package ru.shestakova.model;

import java.util.ListResourceBundle;

public class SyntaxBundle  extends ListResourceBundle{

    private String[][] contents = {
            {"Язык","Язык"},
            {"Русский","Русский"},
            {"Турецкий","Турецкий"},
            {"Литовский","Литовский"},
            {"Испанский","Испанский"},
            {"клиент", "клиент"},
            {"Лабораторная №8 (клиент)", "Лабораторная №8 (клиент)"},
            {"Название","Название"},
            {"Автор","Автор"},
            {"Информация_о_новом_элементе","Информация о новом элементе"},
            {"Красненький","Красненький"},
            {"Зеленый","Зеленый"},
            {"Синий","Синий"},
            {"Желтый","Желтый"},
            {"Розовый","Розовый"},
            {"Магический","Магический"},
            {"Загадочный","Загадочный"},
            {"Научная фантастика","Научная фантастика"},
            {"Путешествие","Путешествие"},
            {"Хоррор","Хоррор"},
            {"Генерировать значение:","Генерировать значение:"},
            {"Генерировать","Генерировать"},
            {"Обновить","Обновить"},
            {"Начать анимацию","Начать анимацию"},
            {"Остановить анимацию","Остановить анимацию"},
            {"Цвет","Цвет"},
            {"Жанр","Жанр"},
            {"Дата создания:","Дата создания:"}
    };

    public String[][] getContents(){
        return contents;
    }

}
